Tekla Open API Reference for Tekla Structures 2025
BindableRadioButton Class
 The BindableRadioButton class represents a RadioButton control that can be bound to the dialog attributes file. Use "Checked" as the BindPropertyName and "Integer" as the AttributeTypeName.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ButtonBase
 System.Windows.Forms.RadioButton
 Tekla.Structures.Dialog.UIControls.BindableRadioButton
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class BindableRadioButton : RadioButton
Public Class BindableRadioButton
	Inherits RadioButton
The BindableRadioButton type exposes the following members.
Constructors
Name | Description
BindableRadioButton
Initializes a new instance of the BindableRadioButton class
Top
Properties
Name | Description
Checked
 Gets or sets a value indicating whether the control is checked.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace